app/controllers/messages_controller.rb

  def join_team
  	@post=Post.find(params[:post_id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1