app/controllers/posts_controller.rb

  def index

    if params[:search].present?
      @posts = Post.near(params[:search], 150)
    else
      @posts = Post.all

    end
     @posts= @posts.where(:is_approved=>true)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`is_approved` = 1

  def old

    if params[:search].present?
      @posts = Post.near(params[:search], 150)
    else
      @posts = Post.all

    end
     @posts= @posts.where(:is_approved=>true)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`is_approved` = 1

  def pending_page
      @posts = Post.where(:is_approved=>false)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`is_approved` = 0

  def my_project
   @user = User.find(current_user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def show
      @post = Post.friendly.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1

  def create

    @post = Post.new(post_params)
    @post.user = current_user

       respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`category`, `compensation_method`, `coverimage_content_type`, `coverimage_file_name`, `coverimage_file_size`, `coverimage_updated_at`, `created_at`, `full_pitch`, `latitude`, `location`, `logoimage_content_type`, `logoimage_file_name`, `logoimage_file_size`, `logoimage_updated_at`, `longitude`, `project_name`, `quick_pitch`, `redirect_url`, `slug`, `to_the_table`, `updated_at`, `url`, `user_id`, `youtube_id`) VALUES ('Startups', 'kishoregarukishoregarukishoregarukishoregarukishoregaru', 'image/jpeg', 'images.jpg', 3996, '2014-08-21 18:59:44', '2014-08-21 18:59:46', '<p>kishoregarukishoregarukishoregarukishoregaru</p>\r\n', 40.7127837, 'new york', 'image/jpeg', 'Hrithik-FunRocker.Com-01.jpg', 20983, '2014-08-21 18:59:45', -74.0059413, 'kishoregaru', 'kishoregarukishoregarukishoregaru', '', 'kishoregaru', 'kishoregarukishoregarukishoregarukishoregarukishoregaru', '2014-08-21 18:59:46', 'www.kishore.com', 1, 'http://www.youtube.com/watch?v=LRARHtMzZQE')